//
// List with coords of Moscow Metro lines and stations
//  [[ftype, ftag, coords, label, centerof, ismap],...]
// Three points with coords and 'Q' literal implements to bezierCurveTo (...) method.
// egax@bk.ru, 2013. r210313.
//
var MLINES=[
['moskva_canal','mc',[
  [-120,29],[-118,32,'Q'],[-118,35,'Q'],[-118,39,'Q'],[-115,60,'Q'],[-115,64,'Q'],[-113,67,'Q'],[-99,80,'Q'],[-97,83,'Q'],[-97,86,'Q'],[-97,152]
]],
['strogino_lake_exit','sle',[
  [-138,65],[-130,71,'Q'],[-127,74,'Q'],[-124,74,'Q'],[-119,74,'Q'],[-117,74,'Q'],[-117,71.5,'Q'],[-117,71.5,'Q'],[-117,68.5,'Q'],[-119,68.5,'Q'],[-131,68.5],[-138,65]
]],
['vodootvodny_canal','vc',[
  [-30,-40],[-27,-40,'Q'],[-24,-40,'Q'],[-21,-38,'Q'],[-13,-30,'Q'],[-9,-27,'Q'],[-7,-27,'Q'],[18,-27,'Q'],[24,-27,'Q'],[27,-31,'Q'],[55,-59]
]],
['yauza_river','yr',[
  [31,-27],[65,-27,'Q'],[77,-27,'Q'],[77,-15,'Q'],[77,30,'Q'],[77,34,'Q'],[80,34,'Q'],[80,34,'Q'],[83,34,'Q'],[83,38,'Q'],[83,71,'Q'],[83,76,'Q'],[79,80,'Q'],[59,99,'Q'],[55,103,'Q'],[50,103,'Q'],[42,103,'Q'],[32,103,'Q'],[32,113,'Q'],[32,114,'Q'],[32,121,'Q'],[39,127,'Q'],[63,147]
]],
['Nagatino_poyma','np',[
  [58,-108],[66.8,-100.3,'Q'],[69,-98,'Q'],[71.5,-98,'Q'],[72.5,-98,'Q'],[74.7,-98,'Q'],[77,-100,'Q'],[83,-106,'Q'],[85,-108,'Q'],[85,-116,'Q']
]],
['grebnoy_canal','gc',[
  [-138,51],[-127,53],[-122,53],[-132,51],[-138,51]
]],
['moskva_river','mr',[
  [-175,78],[-119,78,'Q'],[-110,78,'Q'],[-110,71.5,'Q'],[-110,71.5,'Q'],[-110,65,'Q'],[-119,65,'Q'],[-135,65,'Q'],[-144,65,'Q'],[-144,61,'Q'],[-144,61,'Q'],[-144,57,'Q'],[-135,57,'Q'],[-116,57,'Q'],[-113,57,'Q'],[-113,52,'Q'],[-113,52,'Q'],[-113,47,'Q'],[-116,47,'Q'],[-144,47,'Q'],[-150,47,'Q'],[-150,39.5,'Q'],[-150,39.5,'Q'],[-150,32,'Q'],[-144,32,'Q'],[-129,32,'Q'],[-120,32,'Q'],[-120,28,'Q'], // [-120,12,'Q'],[-120,8,'Q'],[-116,6,'Q'],[-67,6,'Q'],[-59,6,'Q'],[-59,-2,'Q'],[-59,-31,'Q'],[-59,-38,'Q'],[-63,-41,'Q'],[-96,-73,'Q'],[-109,-85,'Q'],[-98,-93,'Q'],[-98,-93,'Q'],[-90,-99,'Q'],[-81,-90,'Q'],[-14,-24,'Q'],[-10,-20,'Q'],[-5,-20,'Q'],[19,-20,'Q'],[25,-20,'Q'],[28,-24,'Q'],[52,-47,'Q'],[55,-51,'Q'],[55,-57,'Q'],[55,-105,'Q'],[55,-109,'Q'],[65,-109,'Q'],[79,-109,'Q'],[85,-109,'Q'],[85,-115,'Q'],[85,-115,'Q'],[85,-117,'Q'],[80,-120.5,'Q'],[80,-120.5,'Q'],[74,-124,'Q'],[74,-130,'Q'],[74,-131,'Q'],[74,-141,'Q'],[84,-141,'Q'],[102,-141,'Q'],[106,-141,'Q'],[111,-147,'Q'],[133,-172]
]],
//
['sheremetyevo_express_line','sheremetyevo_express',[
  [-51,55],[-23,83,'Q'],[-20,86,'Q'],[-20,90,'Q'],[-20,155,'Q'],[-20,159,'Q'],[-23,159,'Q'],[-29,159]
]],
['sheremetyevo_express_line_d','sheremetyevo_express',[
  [-51,55],[-23,83,'Q'],[-20,86,'Q'],[-20,90,'Q'],[-20,155,'Q'],[-20,159,'Q'],[-23,159,'Q'],[-29,159]
]],
['vnukovo_express_line','vnukovo_express',[
  [-75,-20],[-100,-20,'Q'],[-105,-20,'Q'],[-109,-25,'Q'],[-153,-80,'Q'],[-156,-83,'Q'],[-156,-86,'Q'],[-156,-121,'Q'],[-156,-123,'Q'],[-153,-123,'Q'],[-150,-123]
]],
['vnukovo_express_line_d','vnukovo_express',[
  [-75,-20],[-100,-20,'Q'],[-105,-20,'Q'],[-109,-25,'Q'],[-153,-80,'Q'],[-156,-83,'Q'],[-156,-86,'Q'],[-156,-121,'Q'],[-156,-123,'Q'],[-153,-123,'Q'],[-150,-123]
]],
['domodedovo_express_line','domodedovo_express',[
  [51,-61],[51,-179]
]],
['domodedovo_express_line_d','domodedovo_express',[
  [51,-61],[51,-179]
]],
//
['r1','r1',[
  [102,85],[38,21,'Q'],[36,19,'Q'],[34,19,'Q'],[20,19,'Q'],[17,19,'Q'],[14,17,'Q'],[-100,-97],[-128,-126,'Q'],[-130,-128,'Q'],[-130,-130,'Q'],[-130,-156]
]],
['r2','r2',[
  [-92,107,'Q'],[-92,102,'Q'],[-90,100,'Q'],[-34,45,'Q'],[-31,42,'Q'],[-31,38,'Q'],[-31,31,'Q'],[-31,27,'Q'],[-29,24,'Q'],[20,-25,'Q'],[23,-27,'Q'],[23,-31,'Q'],[23,-33,'Q'],[23,-37,'Q'],[26,-39,'Q'],[65,-78,'Q'],[68,-81,'Q'],[68,-85,'Q'],[68,-143,'Q'],[68,-146,'Q'],[70,-149,'Q'],[81,-160],[95,-160]
]],
['r2','r2_1',[
  [-92,123],[-92,114]
]],
['r2','r2_2',[
  [-92,114],[-92,107]
]],
['r3','r3',[
  [-159,98],[-159,18,'Q'],[-159,15,'Q'],[-156,12,'Q'],[-130,-14,'Q'],[-128,-16,'Q'],[-124,-16,'Q'],[-36,-16,'Q'],[-33,-16,'Q'],[-30,-14,'Q'],[-30,-14,'Q'],[-26,-11,'Q'],[-24,-11,'Q'],[53,-11,'Q'],[57,-11,'Q'],[59,-9,'Q'],[137,69]
]],
['r4','r4_1',[
  [-159,34],[-131,6,'Q'],[-128,3,'Q'],[-124,3,'Q'],[-104,3,'Q'],[-101,3,'Q'],[-97,0,'Q'],[-93,-3,'Q'],[-89,-6,'Q'],[-87,-6,'Q'],[-72,-6,'Q'],[-68,-2,'Q'],[-64,-2,'Q'],[-26,-2,'Q'],[-23,-2,'Q'],[-20,-5,'Q'],[-19,-6]
]],
['r4','r4_2',[
  [-72,-6],[-112,21]
]],
['r5','r5',[
  [-70,0],[-69.86,4.40],[-69.45,8.77],[-68.76,13.12],[-67.80,17.41],[-66.57,21.63],[-65.08,25.77],[-63.34,29.80],[-61.34,33.72],[-59.10,37.51],[-56.63,41.14],[-53.94,44.62],[-51.03,47.92],[-47.92,51.03],[-44.62,53.94],[-41.14,56.63],[-37.51,59.10],[-33.72,61.34],[-29.80,63.34],[-25.77,65.08],[-21.63,66.57],[-17.41,67.80],[-13.12,68.76],[-8.77,69.45],[-4.40,69.86],[0.00,70.00],[4.40,69.86],[8.77,69.45],[13.12,68.76],[17.41,67.80],[21.63,66.57],[25.77,65.08],[29.80,63.34],[33.72,61.34],[37.51,59.10],[41.14,56.63],[44.62,53.94],[47.92,51.03],[51.03,47.92],[53.94,44.62],[56.63,41.14],[59.10,37.51],[61.34,33.72],[63.34,29.80],[65.08,25.77],[66.57,21.63],[67.80,17.41],[68.76,13.12],[69.45,8.77],[69.86,4.40],[70.00,0.00],[69.86,-4.40],[69.45,-8.77],[68.76,-13.12],[67.80,-17.41],[66.57,-21.63],[65.08,-25.77],[63.34,-29.80],[61.34,-33.72],[59.10,-37.51],[56.63,-41.14],[53.94,-44.62],[51.03,-47.92],[47.92,-51.03],[44.62,-53.94],[41.14,-56.63],[37.51,-59.10],[33.72,-61.34],[29.80,-63.34],[25.77,-65.08],[21.63,-66.57],[17.41,-67.80],[13.12,-68.76],[8.77,-69.45],[4.40,-69.86],[0.00,-70.00],[-4.40,-69.86],[-8.77,-69.45],[-13.12,-68.76],[-17.41,-67.80],[-21.63,-66.57],[-25.77,-65.08],[-29.80,-63.34],[-33.72,-61.34],[-37.51,-59.10],[-41.14,-56.63],[-44.62,-53.94],[-47.92,-51.03],[-51.03,-47.92],[-53.94,-44.62],[-56.63,-41.14],[-59.10,-37.51],[-61.34,-33.72],[-63.34,-29.80],[-65.08,-25.77],[-66.57,-21.63],[-67.80,-17.41],[-68.76,-13.12],[-69.45,-8.77],[-69.86,-4.40],[-70,0]],'Radial'
],
['r6','r6',[
  [36,129],[36,38,'Q'],[36,35,'Q'],[34,32,'Q'],[34,32,'Q'],[31,28,'Q'],[31,26,'Q'],[31,-22,'Q'],[31,-26,'Q'],[28,-29,'Q'],[-41,-99,'Q'],[-44,-102,'Q'],[-44,-106,'Q'],[-44,-168]
]],
['r6_ext','r6',[
  [36,129],[36,145]
]],
['r7','r7',[
  [-105,102],[-105,79,'Q'],[-105,75,'Q'],[-103,73,'Q'],[-60,31,'Q'],[-58,29,'Q'],[-55,29,'Q'],[0,29,'Q'],[3,29,'Q'],[5,27,'Q'],[26,6,'Q'],[28,4,'Q'],[28,0,'Q'],[28,-10,'Q'],[28,-14,'Q'],[31,-16,'Q'],[92,-77,'Q'],[94.5,-80,'Q'],[98,-80,'Q'],[151,-80,'Q'],[155,-80,'Q'],[158,-84,'Q'],[158,-84,'Q'],[160,-87,'Q'],[160,-90,'Q'],[160,-90,'Q'],[160,-93,'Q'],[157,-96,'Q'],[136,-116,'Q'],[130,-121,'Q'],[130,-125,'Q'],[130,-127]
]],
['r8','r8',[
  [18,-39],[90,-39],[136,6]
]],
['r8','r8_1',[
  [-97,11],[-106,11,'Q'],[-109,11,'Q'],[-112,8,'Q'],[-117,3,'Q'],[-120,0,'Q'],[-120,-3,'Q'],[-120,-44]
]],
['r8_ext','r8',[
  [18.15,-39],[-21,-39,'Q'],[-24,-39,'Q'],[-27,-37,'Q'],[-74,8,'Q'],[-77,11,'Q'],[-80,11,'Q'],[-97,11]
]],
['r8','r8_2',[[-120,-44],[-120,-59,'Q'],[-120,-62,'Q'],[-123,-65,'Q'],[-144,-88,'Q'],[-147,-91,'Q'],[-147,-95,'Q'],[-147,-105]
]],
['r8_ext','r8_3',[
  [-147,-105],[-147,-110],[-147,-120]
]],
['r9','r9',[
  [0,141],[0,137,'Q'],[0,134,'Q'],[-2,131,'Q'],[-26,107,'Q'],[-29,104,'Q'],[-29,101,'Q'],[-29,76,'Q'],[-29,73,'Q'],[-26,70,'Q'],[-5,48,'Q'],[-4,47,'Q'],[-4,46,'Q'],[-4,41,'Q'],[-4,40,'Q'],[-5,39,'Q'],   [-18,25.06,'Q'],[-19,24,'Q'],[-19,21,'Q'],[-19,-19,'Q'],[-19,-22,'Q'],[-16,-25,'Q'],[16,-58,'Q'],[19,-61,'Q'],[19,-64,'Q'],[19,-127,'Q'],[19,-130,'Q'],[16,-133,'Q'],[-12,-168]
]],
['r10','r10',[
  [-24,132],[-24,118,'Q'],[-24,114,'Q'],[-22,112,'Q'],[1,87,'Q'],[4,85,'Q'],[4,81,'Q'],[4,45,'Q'],[4,41,'Q'],[7,38,'Q'],[82,-36,'Q'],[84,-38,'Q'],[84,-42,'Q'],[84,-72,'Q'],[84,-74.5,'Q'],[87,-78,'Q'],[105,-96,'Q'],[108,-99,'Q'],[108,-103,'Q'],[108,-106,'Q'],[108,-109,'Q'],[105,-112,'Q'],[87,-130,'Q'],[84,-133,'Q'],[84,-137,'Q'],[84,-163]
]],
['r10_ext','r10',[
  [-24,132],[-24,153]
]],
['r12','r12',[
  [-16,-168],[-22,-176,'Q'],[-24,-179,'Q'],[-26,-179,'Q'],[-87,-179]
]],
['r12_ext','r12_1',[
  [-87,-179],[-150,-179]
]],
['r12','r12_2',[
  [-41,-168],[-16,-168]
]],
['rKOM_ext','rKOM_1',[
  [-136,-170],[-85,-116],[-14,-116]
]],
['rKOZH','rKOZH',[
  [106,-30],[135,-59,'Q'],[137,-61,'Q'],[137,-65,'Q'],[137,-82,'Q'],[137,-85,'Q'],[140,-88,'Q'],[162,-112,'Q'],[165,-115,'Q'],[165,-118,'Q'],[165,-140]
]],
['rMCK','rMCK',[
  [-117,0],[-116.77,7.35],[-116.08,14.66],[-114.93,21.92],[-113.32,29.1],[-111.27,36.15],[-108.78,43.07],[-105.86,49.82],[-102.53,56.37],[-98.79,62.69],[-94.65,68.77],[-90.15,74.58],[-85.29,80.09],[-80.09,85.29],[-74.58,90.15],[-68.77,94.65],[-62.69,98.79],[-56.37,102.53],[-49.82,105.86],[-43.07,108.78],[-36.15,111.27],[-29.1,113.32],[-21.92,114.93],[-14.66,116.08],[-7.35,116.77],[0,117],[7.35,116.77],[14.66,116.08],[21.92,114.93],[29.1,113.32],[36.15,111.27],[43.07,108.78],[49.82,105.86],[56.37,102.53],[62.69,98.79],[68.77,94.65],[74.58,90.15],[80.09,85.29],[85.29,80.09],[90.15,74.58],[94.65,68.77],[98.79,62.69],[102.53,56.37],[105.86,49.82],[108.78,43.07],[111.27,36.15],[113.32,29.1],[114.93,21.92],[116.08,14.66],[116.77,7.35],[117,-0],[116.77,-7.35],[116.08,-14.66],[114.93,-21.92],[113.32,-29.1],[111.27,-36.15],[108.78,-43.07],[105.86,-49.82],[102.53,-56.37],[98.79,-62.69],[94.65,-68.77],[90.15,-74.58],[85.29,-80.09],[80.09,-85.29],[74.58,-90.15],[68.77,-94.65],[62.69,-98.79],[56.37,-102.53],[49.82,-105.86],[43.07,-108.78],[36.15,-111.27],[29.1,-113.32],[21.92,-114.93],[14.66,-116.08],[7.35,-116.77],[0,-117],[-7.35,-116.77],[-14.66,-116.08],[-21.92,-114.93],[-29.1,-113.32],[-36.15,-111.27],[-43.07,-108.78],[-49.82,-105.86],[-56.37,-102.53],[-62.69,-98.79],[-68.77,-94.65],[-74.58,-90.15],[-80.09,-85.29],[-85.29,-80.09],[-90.15,-74.58],[-94.65,-68.77],[-98.79,-62.69],[-102.53,-56.37],[-105.86,-49.82],[-108.78,-43.07],[-111.27,-36.15],[-113.32,-29.1],[-114.93,-21.92],[-116.08,-14.66],[-116.77,-7.35],[-117,0]
]],
['rMono','rMono',[
  [-26,100],[43,100]
]],
['rTPK','rTPK_1',[
  [20,-136],[60,-136,'Q'],[65,-136,'Q'],[68,-130,'Q']
]],
['rTPK','rTPK_2',[
  [-104,11,'Q'],[-116,18,'Q'],[-116,20,'Q'],[-116,30,'Q'],[-116,32,'Q'],[-112,32,'Q'],[-86,32,'Q'],[-80,32,'Q'],[-80,36,'Q'],[-80,44],[-56.7,67.3]
]],
['rTPK_ext','rTPK_1',[
  [-56.7,67.3],[-44,80,'Q'],[-42,82,'Q'],[-38,82,'Q'],[57,82,'Q'],[60,82,'Q'],[63,80,'Q'],[77,65,'Q'],[80,62,'Q'],[80,59,'Q'],[80,19,'Q'],[80,15,'Q'],[83,13,'Q'],[101,-4,'Q'],[103,-7,'Q'],[103,-11,'Q'],[103,-24,'Q'],[103,-27,'Q'],[106,-30,'Q'],[124,-48],[124,-53,'Q'],[124,-55,'Q'],[123,-56,'Q'],[68,-129]
]],
['rTPK_ext','rTPK_2',[
  [-80,44],[-82,42,'Q'],[-84,40,'Q'],[-88,40,'Q'],[-143,40,'Q'],[-147,40,'Q'],[-149,37,'Q'],[-163,23,'Q'],[-166,20,'Q'],[-166,17,'Q'],[-166,-1,'Q'],[-166,-5,'Q'],[-164,-7,'Q'],[-113,-58,'Q'],[-110,-60,'Q'],[-110,-64,'Q'],[-110,-100.95],[-50,-133],[14.5,-133]
]],
//
['interchange','Kievskaya',[
  [-72,-16],[-72,-6],[-69.09,-11],[-72,-16]
]],
['interchange_d','Kievskaya',[
  [-72,-16],[-72,-6],[-69.09,-11],[-72,-16]
]],
['interchange','Rossyskaya__Kutuzovsky_Prospekt',[
  [-69.38,9.24],[-69.38,3.63]
]],
['interchange_d','Rossyskaya__Kutuzovsky_Prospekt',[
  [-69.38,9.24],[-69.38,3.63]
]],
['interchange','Krasnopresnenskaya__Barrikadnaya',[
  [-64.8,26.41],[-60.34,31.34]
]],
['interchange_d','Krasnopresnenskaya__Barrikadnaya',[
  [-64.8,26.41],[-60.34,31.34]
]],
['interchange','Belorusskaya',[
  [-47,51.84],[-47,57.78]
]],
['interchange_d','Belorusskaya',[
  [-47,51.84],[-47,57.78]
]],
['interchange','Mendeleyevskaya__Novoslobodskaya',[
  [-26,65.36],[-26,70]
]],
['interchange_d','Mendeleyevskaya__Novoslobodskaya',[
  [-26,65.36],[-26,70]
]],
['interchange','Dostoyevskaya__Suvorovskaya',[
  [4,69.88],[4,75]
]],
['interchange_d','Dostoyevskaya__Suvorovskaya',[
  [4,69.88],[4,75]
]],
['interchange','Prospekt_Mira',[
  [33,61.7],[36,65]
]],
['interchange_d','Prospekt_Mira',[
  [33,61.7],[36,65]
]],
['interchange','Komsomolskaya',[
  [55.19,43],[60,43]
]],
['interchange_d','Komsomolskaya',[
  [55.19,43],[60,43]
]],
['interchange','Kurskaya__Chkalobskaya',[
  [69.03,-11.43],[62.27,-5.73],[62.27,-16.53],[69.03,-11.43]
]],
['interchange_d','Kurskaya__Chkalobskaya',[
  [69.03,-11.43],[62.27,-5.73],[62.27,-16.53],[69.03,-11.43]
]],
['interchange','Taganskaya__Marksistskaya',[
  [60,-35.9],[60,-45],[64,-39],[60,-35.9]
]],
['interchange_d','Taganskaya__Marksistskaya',[
  [60,-35.9],[60,-45],[64,-39],[60,-35.9]
]],
['interchange','Paveletskaya',[
  [39.13,-58],[45,-58]
]],
['interchange_d','Paveletskaya',[
  [39.13,-58],[45,-58]
]],
['interchange','Dobryninskaya__Serpukhovskaya',[
  [19,-67.33],[19,-71]
]],
['interchange_d','Dobryninskaya__Serpukhovskaya',[
  [19,-67.33],[19,-71]
]],
['interchange','Oktyabrskaya',[
  [-11.46,-69.03],[-7.92,-65.45]
]],
['interchange_d','Oktyabrskaya',[
  [-11.46,-69.03],[-7.92,-65.45]
]],
['interchange','Park_Kultury',[
  [-53,-45.68],[-53,-50]
]],
['interchange_d','Park_Kultury',[
  [-53,-45.68],[-53,-50]
]],
['interchange','Sokolniki',[
  [76.37,59.36],[76.37,65.67]
]],
['interchange_d','Sokolniki',[
  [76.37,59.36],[76.37,65.67]
]],
['interchange','Turgenevskaya__Chistye_Prudy__Sretensky_Bulvar',[
  [31,24],[35,19],[31,14.32],[31,24]
]],
['interchange_d','Turgenevskaya__Chistye_Prudy__Sretensky_Bulvar',[
  [31,24],[35,19],[31,14.32],[31,24]
]],
['interchange','Kuznetsky_Most__Lubyanka',[
  [11.5,20.5],[11.5,14.5]
]],
['interchange_d','Kuznetsky_Most__Lubyanka',[
  [11.5,20.5],[11.5,14.5]
]],
['interchange','Okhotny_Ryad__Teatralnaya__Ploshcha_Pevolyutsi',[
  [-4,-1],[1,-6],[6,-11]
]],
['interchange_d','Okhotny_Ryad__Teatralnaya__Ploshcha_Pevolyutsi',[
  [-4,-1],[1,-6],[6,-11]
]],
['interchange','Biblioteka_Imeni_Lenina__Arbatskaya__Alexandrovsky_Sad__Borovitskaya',[
  [-14,-11],[-19,-6],[-24,-11],[-14,-11],[-19,-16],[-24,-11]
]],
['interchange_d','Biblioteka_Imeni_Lenina__Arbatskaya__Alexandrovsky_Sad__Borovitskaya',[
  [-14,-11],[-19,-6],[-24,-11],[-14,-11],[-19,-16],[-24,-11]
]],
['interchange','Kropotkinskaya__Volkhonka',[
  [-29.83,-26.83],[-29.83,-34.29]
]],
['interchange_d','Kropotkinskaya__Volkhonka',[
  [-29.83,-26.83],[-29.83,-34.29]
]],
['interchange','Prospekt_Vernadskogo',[
  [-110,-107.5],[-110,-100.95]
]],
['interchange_d','Prospekt_Vernadskogo',[
  [-110,-107.5],[-110,-100.95]
]],
['interchange','Stolbovo',[
  [-125,-158],[-130,-156]
]],
['interchange_d','Stolbovo',[
  [-125,-158],[-130,-156]
]],
['interchange','Dinamo__Petrovsky_Park',[
  [-56.7,67.3],[-52.85,71.15]
]],
['interchange_d','Dinamo__Petrovsky_Park',[
  [-56.7,67.3],[-52.85,71.15]
]],
['interchange','Tverskaya__Pushkinskaya__Chekhovskaya',[
  [-29,24],[-18.55,24],[-23.5,29],[-29,24]
]],
['interchange_d','Tverskaya__Pushkinskaya__Chekhovskaya',[
  [-29,24],[-18.55,24],[-23.5,29],[-29,24]
]],
['interchange','Tretyakovskaya__Novokuznetskaya',[
  [23.10,-33.98],[18.14,-39]
]],
['interchange_d','Tretyakovskaya__Novokuznetskaya',[
  [23.10,-33.98],[18.14,-39]
]],
['interchange','Krasnogvardeyskaya__Zyablikovo',[
  [81,-160],[84,-163]
]],
['interchange_d','Krasnogvardeyskaya__Zyablikovo',[
  [81,-160],[84,-163]
]],
['interchange','Kuntsevskaya',[
  [-159,34],[-152.2,34]
]],
['interchange_d','Kuntsevskaya',[
  [-159,34],[-152.2,34]
]],
['interchange','Smolenskaya__Plyushchikha',[
  [-42,-16],[-42,-22.55]
]],
['interchange_d','Smolenskaya__Plyushchikha',[
  [-42,-16],[-42,-22.55]
]],
['interchange','Elektrozavodskaya',[
  [80,12],[80,19]
]],
['interchange_d','Elektrozavodskaya',[
  [80,12],[80,19]
]],
['interchange','Vystavochnaya__Delovoy_Tsentr',[
  [-97,11],[-104,11]
]],
['interchange_d','Vystavochnaya__Delovoy_Tsentr',[
  [-97,11],[-104,11]
]],
['interchange','Rizhskaya',[
  [36,77],[41,82]
]],
['interchange_d','Rizhskaya',[
  [36,77],[41,82]
]],
['interchange','Kaluzhskaya',[
  [-44,-133],[-48,-133]
]],
['interchange_d','Kaluzhskaya',[
  [-44,-133],[-48,-133]
]],
['interchange','Novoyasenevskaya__Bittsevsky_Park',[
  [-44,-168],[-40,-168]
]],
['interchange_d','Novoyasenevskaya__Bittsevsky_Park',[
  [-44,-168],[-40,-168]
]],
['interchange','Polezhaevskaya__Khoroshyobskaya',[
  [-80,50.54],[-80,44]
]],
['interchange_d','Polezhaevskaya__Khoroshyobskaya',[
  [-80,50.54],[-80,44]
]],
['interchange','Proletarskaya__Krestyanskaya_Zastava',[
  [80,-65],[84,-61]
]],
['interchange_d','Proletarskaya__Krestyanskaya_Zastava',[
  [80,-65],[84,-61]
]],
['interchange','Tekstilshchiki',[
  [105,-80],[108,-76]
]],
['interchange_d','Tekstilshchiki',[
  [105,-80],[108,-76]
]],
['interchange','Lermontovsky_Prospekt__Kosino',[
  [147,-106],[156.5,-106]
]],
['interchange_d','Lermontovsky_Prospekt__Kosino',[
  [147,-106],[156.5,-106]
]],
['interchange','Michurinsky_Prospekt',[
  [-120,-58],[-113,-58]
]],
['interchange_d','Michurinsky_Prospekt',[
  [-120,-58],[-113,-58]
]],
['interchange','Rimskaya__Ploshchad_Ilyicha',[
  [84,-44.92],[90,-39]
]],
['interchange_d','Rimskaya__Ploshchad_Ilyicha',[
  [84,-44.92],[90,-39]
]],
['interchange','Aviamotornaya',[
  [99.22,-30],[106,-30]
]],
['interchange_d','Aviamotornaya',[
  [99.22,-30],[106,-30]
]],
['interchange','Savyolovskaya__Nizhnyaya_Maslovka',[
  [-29,82],[-35,82]
]],
['interchange_d','Savyolovskaya__Nizhnyaya_Maslovka',[
  [-29,82],[-35,82]
]],
['interchange','Tsvetnoy_Bulvar__Trubnaya',[
  [-4,43.5],[4.17,43.5]
]],
['interchange_d','Tsvetnoy_Bulvar__Trubnaya',[
  [-4,43.5],[4.17,43.5]
]],
['interchange','Sevastopolskaya__Kakhovskaya',[
  [16,-133],[20,-136]
]],
['interchange_d','Sevastopolskaya__Kakhovskaya',[
  [16,-133],[20,-136]
]],
['interchange','Bulvar_Dmitriya_Donskogo__Ulitsa_Starokachalovskaya',[
  [-12,-168],[-16,-168]
]],
['interchange_d','Bulvar_Dmitriya_Donskogo__Ulitsa_Starokachalovskaya',[
  [-12,-168],[-16,-168]
]],
['interchange','Marina_Roshcha',[
  [1,87],[6,82]
]],
['interchange_d','Marina_Roshcha',[
  [1,87],[6,82]
]],
['interchange','Pechatniki__Yozhnoportovaya',[
  [98.5,-89],[94.6,-94]
]],
['interchange_d','Pechatniki__Yozhnoportovaya',[
  [98.5,-89],[94.6,-94]
]],
['interchange','Ulitsa_Hovatorov',[
  [-88,-113],[-85,-116]
]],
['interchange_d','Ulitsa_Hovatorov',[
  [-88,-113],[-85,-116]
]],
//
['mck_interchange_d','Okruzhnaya',[
  [-24,117.57],[-30,113]
]],
['mck_interchange_d','Voykovskaya__Baltiiskaya',[
  [-82,92],[-82,83.4]
]],
['mck_interchange_d','Oktyabrskoye_Pole__Panfilovskaya',[
  [-98.3,68.48],[-93,71]
]],
['mck_interchange_d','Khoroshyobskaya__Polezhaevskaya',[
  [-107.2,48],[-81,48]
]],
['mck_interchange_d','Shelepikha',[
  [-116,28],[-113.6,28]
]],
['mck_interchange_d','Delovoy_Tsentr__Mezhdunarodnaya',[
  [-115.2,20],[-112,21]
]],
['mck_interchange_d','Kutuzovskaya',[
  [-120,3],[-116.9,5]
]],
['mck_interchange_d','Sportivnaya__Luzhniki',[
  [-90,-87],[-81.4,-84]
]],
['mck_interchange_d','Ploshad_Gagarina__Leninsky_Prospekt',[
  [-49,-106.2],[-43.04,-102]
]],
['mck_interchange_d','Avtozavodskaya',[
  [72,-92.2],[68,-90]
]],
['mck_interchange_d','Dubrovka',[
  [84,-72],[83.4,-82]
]],
['mck_interchange_d','Shosse_Entuziastov',[
  [109,-20.45],[115.7,-17]
]],
['mck_interchange_d','Izmaylovo__Partizanskaya',[
  [106.7,48],[113.45,45.45]
]],
['mck_interchange_d','Lokomotiv__Cherkizovskaya',[
  [94.2,69.4],[89.16,72.15]
]],
['mck_interchange_d','Bulvar_Rokossovskogo',[
  [102,85],[87.2,78]
]],
['mck_interchange_d','Botanichesky_Sad',[
  [42.6,109],[36,106]
]],
['mck_interchange_d','Vladykino',[
  [-11,122],[-11,116.4]
]
]
];
var MLEGEND=[
['.Latitude','legend_border',[
  [-170,-185],[150,-185],[150,-220],[-170,-220],[-170,-185]
]],  
['r1','r1_legend',[
  [-160,-190],[-140,-190]],'Сокольническая линия (красная)',[-140,-190]],
['r2','r2_legend',[
  [-160,-194],[-140,-194]],'Замоскворецкая линия (зелёная)',[-140,-194]],
['r3','r3_legend',[
  [-160,-198],[-140,-198]],'Арбатско-Покровская линия (синяя)',[-140,-198]],
['r4','r4_legend',[
  [-160,-202],[-140,-202]],'Филёвская линия (голубая)',[-140,-202]],
['rTPK','rTPK_legend',[
  [-160,-210],[-140,-210]],'Третий пересадочный контур',[-140,-210]],
['r5','r5_legend',[
  [-60,-190],[-40,-190]],'Кольцевая линия (коричневая)',[-40,-190]],
['r6','r6_legend',[
  [-60,-194],[-40,-194]],'Калужско-Рижская линия (оранжевая)',[-40,-194]],
['r7','r7_legend',[
  [-60,-198],[-40,-198]],'Таганско-Краснопресненская линия (фиолетовая)',[-40,-198]],
['r8','r8_legend',[
  [-60,-202],[-40,-202]],'Калининская линия (жёлтая)',[-40,-202]],
['r8_ext','r7_legend',[
  [-60,-206],[-40,-206]],'Калининско-Солнцевская линия',[-40,-206]],
['rKOZH','rKOZH_legend',[
  [-60,-210],[-40,-210]],'Кожуховская линия',[-40,-210]],
['r9','r9_legend',[
  [60,-190],[40,-190]],'Серпуховско-Тимирязевская линия (серая)',[60,-190]],
['r10','r10_legend',[
  [60,-194],[40,-194]],'Люблинско-Дмитровская линия (салатовая)',[60,-194]],
['r11','r11_legend',[
  [60,-198],[40,-198]],'Каховская линия (бирюзовая)',[60,-198]],
['r12','r12_legend',[
  [60,-202],[40,-202]],'Бутовская линия (серо-голубая)',[60,-202]],
['rMono_legend','mn_legend',[
  [60,-210],[40,-210]],'Московский монорельс',[60,-210]]
];
var MLABEL=[
  ['moskva_canal_label',               'mc',          [],'Канал им. Москвы',[-97,111]],
  ['moskva_river_label',               'mr',          [],'Москва-река',     [113,-147]],
  ['yauza_river_label',                'yr',          [],'Яуза',            [59,99]],
  ['sheremetyevo_express_line_label',  'shvo_expr',   [],'Шереметьево',     [-29,159]],
  ['sheremetyevo_express_line_d_label','shvo_expr',   [],'Белорусский',     [-51,55]],
  ['vnukovo_express_line_label',       'vkvo_expr',   [],'Внуково',         [-155,-128]],
  ['vnukovo_express_line_d_label',     'vkvo_expr',   [],'Киевский',        [-75,-21]],
  ['domodedovo_express_line_label',    'dmvo_expr',   [],'Павелецкий',      [51,-61]],
  ['domodedovo_express_line_d_label',  'dmvo_expr',   [],'Домодедово',      [51,-179]]
];
var MSTATIONS=[
  ['s1',     'Bulvar_Rokossovskogo',[[102,85]],        'Бульвар Рокоссовского' ],
  ['s1_7',   'Cherkizovskaya',      [[89.16,72.15]],   'Черкизовская'          ],
  ['s1_6',   'Preobrazhenskaya_Pl', [[84.31,67.31]],   'Преображенская площадь'],
  ['s1_1',   'Sokolniki',           [[76.37,59.36]],   'Сокольники'            ],
  ['s1',     'Krasnoselskaya',      [[68.52,51.52]],   'Красносельская'        ],
  ['s1_1',   'Komsomolskaya',       [[60,43]],         'Комсомольская'         ],
  ['s1',     'Krasniye_Vorota',     [[48.89,31.89]],   'Красные ворота'        ],
  ['s1_1',   'Chistye_Prudy',       [[35,19]],         'Чистые пруды'          ],
  ['s1_2',   'Lubyanka',            [[11.5,14.5]],     'Лубянка'               ],
  ['s1_1',   'Okhotny_Ryad',        [[-4,-1]],         'Охотный ряд'           ],
  ['s1_4',   'Biblioteka_Im_Lenina',[[-14,-11]],       'Библиотека им. Ленина' ],
  ['s1_1',   'Kropotkinskaya',      [[-29.83,-26.83]], 'Кропоткинская'         ],
  ['s1_2',   'Park_Kultury',        [[-53,-50]],       'Парк Культуры'         ],
  ['s1',     'Frunzenskaya',        [[-73.4,-70.2]],   'Фрунзенская'           ],
  ['s1',     'Sportivnaya',         [[-90,-87]],       'Спортивная'            ],
  ['s1',     'Vorobyovy_Gory',      [[-97,-94]],       'Воробьёвы горы'        ],
  ['s1',     'Universitet',         [[-103,-100]],     'Университет'           ],
  ['s1_2',   'Prospekt_Vernadskogo',[[-110,-107.5]],   'Пр-т Вернадского'      ],
  ['s1',     'Yugo-Zapadnaya',      [[-113,-110.5]],   'Юго-Западная'          ],
  ['s1',     'Troparyovo',          [[-118,-115.5]],   'Тропарёво'             ],
  ['s1',     'Rumyantsevo',         [[-123,-120.8]],   'Румянцево'             ],
  ['s1',     'Salaryevo',           [[-128,-126]],     'Саларьево'             ],
  ['s1_5',   'Filatov_Lug',         [[-130,-134]],     'Филатов Луг'           ],
  ['s1_5',   'Prokshino',           [[-130,-142]],     'Прокшино'              ],
  ['s1_5',   'Olhovaya',            [[-130,-149]],     'Ольховая'              ],
  ['s1_5',   'Stolbovo',            [[-130,-156]],     'Коммунарка'            ],
  //
  ['s2',     'Khovrino',            [[-92,123]],       'Ховрино'               ],
  ['s2',     'Belomorskaya',        [[-92,115]],       'Беломорская'           ],
  ['s2',     'Rechnoy_Vokzal',      [[-92,107]],       'Речной вокзал'         ],
  ['s2',     'Vodny_Stadion',       [[-89,99.07]],     'Водный стадион'        ],
  ['s2',     'Voykovskaya',         [[-82,92]],        'Войковская'            ],
  ['s2',     'Sokol',               [[-70,80.36]],     'Сокол'                 ],
  ['s2',     'Aeroport',            [[-64,74.46]],     'Аэропорт'              ],
  ['s2_2',   'Dinamo',              [[-56.7,67.3]],    'Динамо'                ],
  ['s2_1',   'Belorusskaya',        [[-47,57.78]],     'Белорусская'           ],
  ['s2',     'Mayakovskaya',        [[-31,38]],        'Маяковская'            ],
  ['s2_7',   'Tverskaya',           [[-29,24]],        'Тверская'              ],
  ['s2_1',   'Teatralnaya',         [[1,-6]],          'Театральная'           ],
  ['s2_2',   'Novokuznetskaya',     [[23.10,-33.98]],  'Новокузнецкая'         ],
  ['s2_3',   'Paveletskaya',        [[45,-58]],        'Павелецкая'            ],
  ['s2_4',   'Avtozavodskaya',      [[68,-90]],        'Автозаводская'         ],
  ['s2_4',   'Tekhnopark',          [[68,-104]],       'Технопарк'             ],
  ['s2_4',   'Kolomenskaya',        [[68,-113]],       'Коломенская'           ],
  ['s2_3',   'Kashirskaya',         [[68,-130]],       'Каширская'             ],
  ['s2_4',   'Kantemirovskaya',     [[68,-139]],       'Кантемировская'        ],
  ['s2_4',   'Tsaritsyno',          [[68,-145]],       'Царицыно'              ],
  ['s2_4',   'Orekhovo',            [[71.5,-150.5]],   'Орехово'               ],
  ['s2_4',   'Domodedovskaya',      [[76,-155]],       'Домодедовская'         ],
  ['s2_2',   'Krasnogvardeyskaya',  [[81,-160]],       'Красногвардейская'     ],
  ['s2_6',   'Alma-Atinskaya',      [[95,-160]],       'Алма-Атинская'         ],
  //
  ['s3',     'Pyatnitskoye_Shosse', [[-159,98]],       'Пятницкое шоссе'       ],
  ['s3',     'Mitino',              [[-159,90]],       'Митино'                ],
  ['s3',     'Volokolamskaya',      [[-159,82]],       'Волоколамская'         ],
  ['s3',     'Myakinino',           [[-159,74]],       'Мякинино'              ],
  ['s3',     'Strogino',            [[-159,66]],       'Строгино'              ],
  ['s3',     'Krylatskoye',         [[-159,58]],       'Крылатское'            ],
  ['s3',     'Molodyozhnaya',       [[-159,50]],       'Молодёжная'            ],
  ['s3_8',   'Kuntsevskaya',        [[-159,34]],       'Кунцевская'            ],
  ['s3_2',   'Slavyansky_Bulvar',   [[-141,-3]],       'Славянский бульвар'    ],
  ['s3_5',   'Park_Pobedy',         [[-120,-16]],      'Парк Победы'           ],
  ['s3_3',   'Kievskaya',           [[-72,-16]],       'Киевская'              ],
  ['s3_3',   'Smolenskaya',         [[-42,-16]],       'Смоленская'            ],
  ['s3_7',   'Arbatskaya',          [[-24,-11]],       'Арбатская'             ],
  ['s3_4',   'Ploshad_Revolyutsii', [[6,-11]],         'Площадь Революции'     ],
  //['s3',     'Khmelnitskaya',       [[36.1,-11]],      'Хмельницкая'           ],
  ['s3_7',   'Kurskaya',            [[62.27,-5.73]],   'Курская'               ],
  ['s3',     'Baumanskaya',         [[74,6]],          'Бауманская'            ],
  ['s3_6',   'Elektrozavodskaya',   [[80,12]],         'Электрозаводская'      ],
  ['s3',     'Semyonovskaya',       [[100.6,32.6]],    'Семёновская'           ],
  ['s3',     'Partizanskaya',       [[113.45,45.45]],  'Партизанская'          ],
  ['s3',     'Izmaylovskaya',       [[121.3,53.3]],    'Измайловская'          ],
  ['s3',     'Pervomayskaya',       [[129.15,61.15]],  'Первомайская'          ],
  ['s3',     'Shchyolkovskaya',     [[137,69]],        'Щёлковская'            ],
  //
  ['s4',     'Mezhdunarodnaya',     [[-112,21]],       'Международная'         ],
  ['s4_4',   'Vystavochnaya',       [[-97,11]],        'Выставочная'           ],
  ['s4_5',   'Kuntsevskaya',        [[-159,34]],       ''                      ],
  ['s4',     'Pionerskaya',         [[-152.01,27.01]], 'Пионерская'            ],
  ['s4',     'Filyovsky_Park',      [[-144.94,19.94]], 'Филёвский парк'        ],
  ['s4',     'Bagrationovskaya',    [[-137.88,12.88]], 'Багратионовская'       ],
  ['s4',     'Fili',                [[-131.08,6.08]],  'Фили'                  ],
  ['s4_1',   'Kutuzovskaya',        [[-120,3]],        'Кутузовская'           ],
  ['s4_1',   'Studencheskaya',      [[-93,-3]],        'Студенческая'          ],
  ['s4_2',   'Kievskaya',           [[-72,-6]],        ''                      ],
  ['s4_6',   'Smolenskaya',         [[-52.85,-2]],     'Смоленская-2'          ],
  ['s4_3',   'Arbatskaya',          [[-32.7,-2]],      'Арбатская-2'           ],
  ['s4_2',   'Alexandrovsky_Sad',   [[-19,-6]],        'Александровский сад'   ],
  //
  ['s5',     'Komsomolskaya',       [[55.19,43]],      ''                      ],
  ['s5',     'Kurskaya',            [[69.03,-11.43]],  'Курская'               ],
  ['s5',     'Taganskaya',          [[60,-35.98]],     'Таганская'             ],
  ['s5',     'Paveletskaya',        [[39.13,-58]],     ''                      ],
  ['s5',     'Dobryninskaya',       [[19,-67.33]],     'Добрынинская'          ],
  ['s5',     'Oktyabrskaya',        [[-11.46,-69]],    ''                      ],
  ['s5_1',   'Park_Kultury',        [[-53,-45.68]],    ''                      ],
  ['s5',     'Kievskaya',           [[-69.09,-11]],    ''                      ],
  ['s5',     'Rossyskaya',          [[-69.38,9.24]],   'Российская'            ],
  ['s5_2',   'Krasnopresnenskaya',  [[-64.8,26.41]],   'Краснопресненская'     ],
  ['s5_2',   'Belorusskaya',        [[-47,51.84]],     'Белорусская'           ],
  ['s5_2',   'Novoslobodskaya',     [[-26,65]],        'Новослободская'        ],
  ['s5',     'Suvorovskaya',        [[4,69.88]],       'Суворовская'           ],
  ['s5',     'Prospekt_Mira',       [[33,61.7]],       ''                      ],
  //
  ['s6',     'Mytishchi',           [[36,145]],        'Мытищи'                ],
  ['s6',     'Chelobityevo',        [[36,137]],        'Челобитьево'           ],
  ['s6',     'Medvedkovo',          [[36,129]],        'Медведково'            ],
  ['s6',     'Babushkinskaya',      [[36,121]],        'Бабушкинская'          ],
  ['s6',     'Sviblovo',            [[36,113]],        'Свиблово'              ],
  ['s6',     'Botanichesky_Sad',    [[36,106]],        'Ботанический сад'      ],
  ['s6',     'VDNH',                [[36,98]],         'ВДНХ'                  ],
  ['s6',     'Alexeyevskaya',       [[36,90]],         'Алексеевская'          ],
  ['s6_2',   'Rizhskaya',           [[36,77]],         'Рижская'               ],
  ['s6_4',   'Prospekt_Mira',       [[36,65]],         'Проспект Мира'         ],
  ['s6_1',   'Sukharevskaya',       [[36,49]],         'Сухаревская'           ],
  ['s6_2',   'Turgenevskaya',       [[31,24]],         'Тургеневская'          ],
  ['s6_2',   'Kitay-Gorod',         [[31,-16]],        'Китай-город'           ],
  ['s6_4',   'Tretyakovskaya',      [[18.14,-39]],     'Третьяковская'         ],
  ['s6_3',   'Oktyabrskaya',        [[-7.92,-65.45]],  'Октябрьская'           ],
  ['s6',     'Shabolovskaya',       [[-32.89,-90.83]], 'Шаболовская'           ],
  ['s6',     'Leninsky_Prospekt',   [[-43.04,-102]],   'Ленинский пр-т'        ],
  ['s6',     'Akademicheskaya',     [[-44,-112]],      'Академическая'         ],
  ['s6',     'Profsoyuznaya',       [[-44,-119]],      'Профсоюзная'           ],
  ['s6',     'Noviye_Cheryomushki', [[-44,-126]],      'Новые Черёмушки'       ],
  ['s6_7',   'Kaluzhskaya',         [[-44,-133]],      'Калужская'             ],
  ['s6',     'Belyayevo',           [[-44,-140]],      'Беляево'               ],
  ['s6',     'Konkovo',             [[-44,-147]],      'Коньково'              ],
  ['s6',     'Tyoplyi_Stan',        [[-44,-154]],      'Тёплый Стан'           ],
  ['s6',     'Yasenevo',            [[-44,-161]],      'Ясенево'               ],
  ['s6_5',   'Novoyasenevskaya',    [[-44,-168]],      'Новоясеневская'        ],
  //
  ['s7',     'Planernaya',          [[-105,102]],      'Планерная'             ],
  ['s7',     'Skhodnenskaya',       [[-105,94]],       'Сходненская'           ],
  ['s7',     'Tushinskaya',         [[-105,86]],       'Тушинская'             ],
  ['s7',     'Spartak',             [[-105,79]],       'Спартак'               ],
  ['s7',     'Shchukinskaya',       [[-103,73]],       'Щукинская'             ],
  ['s7',     'Oktyabrskoye_Pole',   [[-98.3,68.5]],    'Октябрьское поле'      ],
  ['s7_1',   'Polezhaevskaya',      [[-80,50.54]],     'Полежаевская'          ],
  ['s7_9',   'Begovaya',            [[-72,42.7]],      'Беговая'               ],
  ['s7_9',   'Ulitsa_1905_Goda',    [[-67,37.8]],      'Улица 1905 года'       ],
  ['s7_10',  'Barrikadnaya',        [[-60.34,31.34]],  'Баррикадная'           ],
  ['s7_2',   'Pushkinskaya',        [[-23.5,29]],      'Пушкинская'            ],
  ['s7_1',   'Kuznetsky_Most',      [[11.5,20.5]],     'Кузнецкий мост'        ],
  ['s7_5',   'Kitay-Gorod',         [[31,-16]],        ''                      ],
  ['s7_2',   'Taganskaya',          [[60,-45]],        ''                      ],
  ['s7_6',   'Proletarskaya',       [[80,-65]],        'Пролетарская'          ],
  ['s7_4',   'Volgograd_Prospekt',  [[92,-77]],        'Волгоградский пр-т'    ],
  ['s7_3',   'Tekstilshchiki',      [[105,-80]],       'Текстильщики'          ],
  ['s7_7',   'Kuzminki',            [[126,-80]],       'Кузьминки'             ],
  ['s7_4',   'Ryazan_Prospekt',     [[142,-80]],       'Рязанский пр-т'        ],
  ['s7',     'Vykhino',             [[160,-90]],       'Выхино'                ],
  ['s7_1',   'Lermontov_Prospekt',  [[147,-106]],      'Лермонтовский пр-т'    ],
  ['s7',     'Zhulebino',           [[135,-117]],      'Жулебино'              ],
  ['s7_8',   'Kotelniki',           [[130,-127]],      'Котельники'            ],
  //
  ['s8',     'Vnukovo',             [[-147,-120]],     'Внуково'               ],
  ['s8',     'Pyhtino',             [[-147,-112]],     'Пыхтино'               ],
  ['s8',     'Rasskazovka',         [[-147,-104]],     'Рассказовка'           ],
  ['s8',     'Novoperedelkino',     [[-147,-96]],      'Новопеределкино'       ],
  ['s8',     'Borovskoye_Shosse',   [[-143.4,-87]],    'Боровское шоссе'       ],
  ['s8',     'Solntsevo',           [[-137,-80]],      'Солнцево'              ],
  ['s8',     'Govorovo',            [[-130.3,-73]],    'Говорово'              ],
  ['s8',     'Ozernaya',            [[-124,-66]],      'Озёрная'               ],
  ['s8_2',   'Michurinsky_Prospekt',[[-120,-58]],      ''                      ],
  ['s8',     'Ramenki',             [[-120,-44]],      'Раменки'               ],
  ['s8',     'Lomonosov_Prospekt',  [[-120,-35]],      'Ломоносовский пр-т'    ],
  ['s8',     'Minskaya',            [[-120,-25]],      'Минская'               ],
  ['s8_6',   'Park_Pobedy',         [[-120,-16]],      ''                      ],
  ['s8_2',   'Delovoy_Tsentr',      [[-104,11]],       'Деловой центр'         ],
  ['s8_3',   'Kutuzovsky_Prospekt', [[-69.38,3.63]],   'Дорогомиловская'       ],
  ['s8_4',   'Plyushchikha',        [[-42,-22.55]],    'Плющиха'               ],
  ['s8_1',   'Volkhonka',           [[-29.83,-34.29]], 'Волхонка'              ],
  ['s8_6',   'Tretyakovskaya',      [[18.14,-39]],     ''                      ],
  ['s8_2',   'Marksistskaya',       [[64,-39]],        'Марксистская'          ],
  ['s8_1',   'Ploshchad_Ilicha',    [[90,-39]],        'Площадь Ильича'        ],
  ['s8_1',   'Aviamotornaya',       [[99.22,-30]],     ''                      ],
  ['s8',     'Shosse_Entuziastov',  [[109,-20.45]],    'Шоссе Энтузиастов'     ],
  ['s8',     'Perovo',              [[120,-9.64]],     'Перово'                ],
  ['s8',     'Novogireevo',         [[128,-1.82]],     'Новогиреево'           ],
  ['s8',     'Novokosino',          [[136,6]],         'Новокосино'            ],
  //
  ['s9',     'Altufyevo',           [[0,141]],         'Алтуфьево'             ],
  ['s9',     'Bibirevo',            [[-0.5,134]],      'Бибирево'              ],
  ['s9',     'Otradnoye',           [[-5,128]],        'Отрадное'              ],
  ['s9',     'Vladykino',           [[-11,122]],       'Владыкино'             ],
  ['s9_2',   'Petr-Razumovskaya',   [[-21.52,111.48]], 'Петровско-Разумовская' ],
  ['s9_4',   'Timiryazevskaya',     [[-29,101]],       'Тимирязевская'         ],
  ['s9',     'Dmitrovskaya',        [[-29,91]],        'Дмитровская'           ],
  ['s9_3',   'Savyolovskaya',       [[-29,82]],        'Савёловская'           ],
  ['s9_5',   'Mendeleyevskaya',     [[-26,70]],        'Менделеевская'         ],
  ['s9_1',   'Tsvetnoy_Bulvar',     [[-4,43.5]],       'Цветной бульвар'       ],
  ['s9_2',   'Chekhovskaya',        [[-18.55,24]],     'Чеховская'             ],
  ['s9_3',   'Borovitskaya',        [[-19,-16]],       'Боровицкая'            ],
  ['s9_4',   'Polyanka',            [[6,-47.69]],      'Полянка'               ],
  ['s9_2',   'Serpukhovskaya',      [[19,-71]],        'Серпуховская'          ],
  ['s9',     'Tulskaya',            [[19,-99]],        'Тульская'              ],
  ['s9',     'Nagatinskaya',        [[19,-117]],       'Нагатинская'           ],
  ['s9',     'Nagornaya',           [[19,-123]],       'Нагорная'              ],
  ['s9',     'Nakhimovsky_Prospekt',[[18.8,-129]],     'Нахимовский пр-т'      ],
  ['s9_6',   'Sevastopolskaya',     [[16,-133]],       'Севастопольская'       ],
  ['s9',     'Chertanovskaya',      [[11.2,-139]],     'Чертановская'          ],
  ['s9',     'Yuzhnaya',            [[6.3,-145]],      'Южная'                 ],
  ['s9',     'Prazhskaya',          [[1.5,-151]],      'Пражская'              ],
  ['s9',     'Ulitsa_Ak_Yangelya',  [[-3.3,-157]],     'Ул. Академика Янгеля'  ],
  ['s9',     'Annino',              [[-8,-163]],       'Аннино'                ],
  ['s9_2',   'Bulvar_Dm_Donskogo',  [[-12,-168]],      'Бульвар Дм. Донского'  ],
  //
  ['s10',    'Fizteh',              [[-24,153]],       'Поселок Северный'      ],
  ['s10',    'Lianozovo',           [[-24,146]],       'Лианозово'             ],
  ['s10',    'Ul_800_Letiya_Moskvy',[[-24,139]],       'Ул. 800-летия Москвы'  ],
  ['s10',    'Seligerskaya',        [[-24,132]],       'Селигерская'           ],
  ['s10',    'Verkhniye_Likhobory', [[-24,125]],       'Верхние Лихоборы'      ],
  ['s10',    'Okruzhnaya',          [[-24,117.57]],    'Окружная'              ],
  ['s10_4',  'Petr-Razumovskaya',   [[-21.52,111.48]], ''                      ],
  ['s10_1',  'Fonvizinskaya',       [[-13.87,103.16]], 'Фонвизинская'          ],
  ['s10_1',  'Butyrskaya',          [[-6.02,94.63]],   'Бутырская'             ],
  ['s10_2',  'Marina_Roshcha',      [[1,87]],          'Марьина Роща'          ],
  ['s10_2',  'Dostoyevskaya',       [[4,75]],          'Достоевская'           ],
  ['s10_2',  'Trubnaya',            [[4.17,43.5]],     'Трубная'               ],
  ['s10_2',  'Sretensky_Bulvar',    [[31,14.32]],      'Сретенский бульвар'    ],
  ['s10_2',  'Chkalovskaya',        [[62.27,-16.53]],  'Чкаловская'            ],
  ['s10_2',  'Rimskaya',            [[84,-44.92]],     'Римская'               ],
  ['s10_2',  'Krestyansk_Zastava',  [[84,-61]],        'Крестьянская застава'  ],
  ['s10',    'Dubrovka',            [[84,-72]],        'Дубровка'              ],
  ['s10_5',  'Kozhukhovskaya',      [[92,-83]],        'Кожуховская'           ],
  ['s10_2',  'Pechatniki',          [[98.5,-89]],      'Печатники'             ],
  ['s10',    'Volzhskaya',          [[108,-106]],      'Волжская'              ],
  ['s10_1',  'Lyublino',            [[99,-118]],       'Люблино'               ],
  ['s10_1',  'Bratislavskaya',      [[91,-126]],       'Братиславская'         ],
  ['s10_1',  'Marino',              [[84,-137]],       'Марьино'               ],
  ['s10_1',  'Borisovo',            [[84,-145]],       'Борисово'              ],
  ['s10_1',  'Shipilovskaya',       [[84,-153]],       'Шипиловская'           ],
  ['s10_3',  'Zyablikovo',          [[84,-163]],       'Зябликово'             ],
  //
  ['sTPK_4', 'Kakhovskaya',         [[20,-136]],       'Каховская'             ],
  ['sTPK_10','Varshavskaya',        [[42,-136]],       'Варшавская'            ],
  ['sTPK_5', 'Kashirskaya',         [[68,-130]],       ''                      ],
  //
  ['s12_4',  'Bittsevsky_Park',     [[-40,-168]],      'Битцевский парк'       ],
  ['s12_1',  'Lesoparkovaya',       [[-28,-168]],      'Лесопарковая'          ],
  ['s12_5',  'Starokachalovskaya',  [[-16,-168]],      'Ул. Старокачаловская'  ],
  ['s12_2',  'Ulitsa_Skobelevskaya',[[-28,-179]],      'Ул. Скобелевская'      ],
  ['s12_1',  'Bulvar_Adm_Ushakova', [[-45,-179]],      'Б-р Адм Ушакова'       ],
  ['s12',    'Ulitsa_Gorchakova',   [[-66,-179]],      'Ул. Горчакова'         ],
  ['s12_1',  'Buninskaya_Alleya',   [[-87,-179]],      'Бунинская аллея'       ],
  ['s12',    'Potapovo',            [[-108,-179]],     'Потапово'              ],
  ['s12_1',  'Chechyorsky_Proezd',  [[-129,-179]],     'Чечёрский проезд'      ],
  ['s12',    'Novokuryanovo',       [[-150,-179]],     'Новокурьяново'         ],
  //
  ['sTPK_3', 'Kuntsevskaya',        [[-152.2,34]],     'Можайская'             ],
  ['sTPK_8', 'Terekhovo',           [[-137,40]],       'Терехово'              ],
  ['sTPK_6', 'Mnyovniki',           [[-121,40]],       'Н. Мнёвники'           ],
  ['sTPK',   'Ulitsa_N.Opolchen',   [[-105,40]],       'Ул. Народ. Ополчения'  ],
  ['sTPK_5', 'Delovoy_Tsentr',      [[-104,11]],       ''                      ],
  ['sTPK_8', 'Shelepikha',          [[-116,28]],       'Шелепиха'              ],
  ['sTPK_9', 'Khoroshyobskaya',     [[-80,44]],        'Хорошёвская'           ],
  ['sTPK_1', 'CSKA',                [[-67.5,56.5]],    'ЦСКА'                  ],
  ['sTPK_3', 'Petrovsky_Park',      [[-52.85,71.15]],  'Петровский Парк'       ],
  ['sTPK_14','Nizhnyaya_Maslovka',  [[-35,82]],        'Н.Масловка'            ],
  ['sTPK_11','Sheremetievskaya',    [[6,82]],          'Шереметьевская'        ],
  ['sTPK_4', 'Rzhevskaya',          [[41,82]],         'Ржевская'              ],
  ['sTPK_9', 'Sokolniki',           [[76.37,65.67]],   'Стромынка'             ],
  ['sTPK_3', 'Elektrozavodskaya',   [[80,19]],         'Рубцовская'            ],
  ['sTPK_7', 'Lefortovo',           [[98.63,-1.76]],   'Лефортово'             ],
  ['sTPK_3', 'Aviamotornaya',       [[106,-30]],       'Авиамоторная'          ],
  ['sTPK_3', 'Nizhegorodskaya_Ul',  [[120,-44]],       'Нижегородская улица'   ],
  ['sTPK_3', 'Tekstilshchiki',      [[108,-76]],       ''                      ],
  ['sTPK',   'Yozhnoportovaya',     [[94.6,-94]],      'Южнопортовая'          ],
  ['sTPK_7', 'Nagatinsky_Zaton',    [[79,-114]],       'Кленовый бульвар'      ],
  ['sTPK_15','Zyuzino',             [[-12,-133]],      'Зюзино'                ],
  ['sTPK_13','Vorontsovskaya',      [[-48,-133]],      'Воронцовская'          ],
  ['sTPK_1', 'Ulitsa_Hovatorov',    [[-88,-113]],      'Ул. Новаторов'         ],
  ['sTPK_3', 'Prospekt_Vernadskogo',[[-110,-100.95]],  ''                      ],
  ['sTPK_3', 'Michurinsky_Prospekt',[[-113,-58]],      'Мичуринский пр-т'      ],
  ['sTPK_2', 'Aminyevskoye_Shosse', [[-135.26,-35.74]],'Аминьевское шоссе'     ],
  ['sTPK_2', 'Davydkovo',           [[-145.73,-25.27]],'Давыдково'             ],
  //
  ['sKOM',   'Ulitsa_Hovatorov',    [[-85,-116]],      ''                      ],
  ['sKOM',   'Ulitsa_Ak_Oparina',   [[-92,-123]],      'Ул. Академика Опарина' ],
  ['sKOM',   'Ulitsa_Gen_Tuleneva', [[-98,-130]],      'Ул. Генерала Тюленева' ],
  ['sKOM',   'Slavyanskiy_Mir',     [[-105,-137]],     'Славянский мир'        ],
  ['sKOM',   'Mamyri',              [[-111.5,-144]],   'Мамыри'                ],
  ['sKOM',   'Kommunarka',          [[-118,-151]],     'Коммунарка'            ],
  ['sKOM',   'Stolbovo',            [[-125,-158]],     'Столбово'              ],
  ['sKOM',   'Sosenki',             [[-130.5,-164]],   'Сосенки'               ],
  ['sKOM',   'Desna',               [[-136,-170]],     'Десна'                 ],
  //
  ['sKOZH_3','Aviamotornaya',       [[106,-30]],       ''                      ],
  ['sKOZH_3','Nizhegorodskaya_Ul',  [[120,-44]],       ''                      ],
  ['sKOZH',  'Stahanovskaya_Ul',    [[132.7,-56.7]],   'Стахановская улица'    ],
  ['sKOZH',  'Okskaya_Ulitsa',      [[137,-68]],       'Окская улица'          ],
  ['sKOZH_1','Ferganskaya_Ulitsa',  [[143.1,-91.4]],   'Юго-восточная улица'   ],
  ['sKOZH_2','Kosino',              [[156.5,-106]],    'Косино'                ],
  ['sKOZH_1','Saltykovskaya_Ulitsa',[[165,-122]],      'Ул. Дмитриевского'     ],
  ['sKOZH_1','Kosino-Ukhtomskaya',  [[165,-131]],      'Лухмановская'          ],
  ['sKOZH_1','Nekrasovka',          [[165,-140]],      'Некрасовка'            ],
  //
  ['sMono',  'Timiryazevskaya',     [[-26,100]],       ''                      ],
  ['sMono',  'Ulitsa_Milashenkova', [[-13,100]],       ''                      ],
  ['sMono',  'Teletsentr',          [[1,100]],         ''                      ],
  ['sMono',  'Ulitsa_Ak_Koroleva',  [[17,100]],        ''                      ],
  ['sMono',  'Vystavochny_Tsentr',  [[33,100]],        ''                      ],
  ['sMono_1','Ulitsa_Eyzenshteyna', [[43,100]],        ''                      ],
  //    
  ['sMCK',   'Vladykino',           [[-11,116.4]],     ''                      ],
  ['sMCK',   'Okruzhnaya',          [[-30,113]],       ''                      ],
  ['sMCK',   'Lihobory',            [[-44,108.4]],     'Лихоборы'              ],
  ['sMCK',   'Koptevo',             [[-62.8,98.6]],    'Коптево'               ],
  ['sMCK',   'Baltiiskaya',         [[-82,83.4]],      'Балтийская'            ],
  ['sMCK',   'Streshnevo',          [[-87.6,77.5]],    'Стрешнево'             ],
  ['sMCK',   'Panfilovskaya',       [[-93,71]],        'Панфиловская'          ],
  ['sMCK',   'Zorge',               [[-102.7,56]],     'Зорге'                 ],
  ['sMCK_2', 'Horoshevo',           [[-106.6,48]],     'Хорошёво'              ],
  ['sMCK',   'Shelepikha',          [[-113.6,28]],     'Шелепиха'              ],
  ['sMCK_1', 'Delovoy_Tsentr',      [[-115.2,20]],     'Деловой центр'         ],
  ['sMCK',   'Kutuzovskaya',        [[-116.9,5]],      'Кутузовская'           ],
  ['sMCK',   'Luzhniki',            [[-81.4,-84]],     'Лужники'               ],
  ['sMCK',   'Ploshad_Gagarina',    [[-49,-106.2]],    'Площадь Гагарина'      ],
  ['sMCK_4', 'Krymskaya',           [[-14,-116.2]],    'Крымская'              ],
  ['sMCK_3', 'Verhnie_Kotly',       [[30,-113.1]],     'Верхние Котлы'         ],
  ['sMCK_2', 'ZIL',                 [[50,-105.8]],     'ЗИЛ'                   ],
  ['sMCK',   'Avtozavodskaya',      [[72,-92.2]],      ''                      ],
  ['sMCK',   'Dubrovka',            [[83.4,-82]],      ''                      ],
  ['sMCK',   'Ugreshskaya',         [[101.5,-58]],     'Угрешская'             ],
  ['sMCK',   'Novohohlovskaya',     [[106.6,-48]],     'Новохохловская'        ],
  ['sMCK',   'Nizhegorodskaya',     [[111.5,-35.5]],   'Нижегородская'         ],
  ['sMCK',   'Delovoy_Tsentr',      [[114.3,-25]],     'Андроновка '           ],
  ['sMCK',   'Shosse_Entuziastov',  [[115.7,-17]],     'Шоссе Энтузиастов'     ],
  ['sMCK',   'Sokolinaya_Gora',     [[116.3,12]],      'Соколиная гора'        ],
  ['sMCK_2', 'Izmaylovo',           [[106.7,48]],      'Измайлово'             ],
  ['sMCK',   'Lokomotiv',           [[94.2,69.4]],     'Локомотив'             ],
  ['sMCK',   'Bulvar_Rokossovskogo',[[87.2,78]],       ''                      ],
  ['sMCK',   'Izmaylovo',           [[74.8,90]],       'Белокаменная'          ],
  ['sMCK',   'Rostokino',           [[60.6,100]],      'Ростокино'             ],
  ['sMCK',   'Botanicheskiy_Sad',   [[42.6,109]],      'Ботанический сад'      ]
];
